{"language":"en","theme":"Family Life","title":"Honoring Your Father","long_reading":"Exodus 20:1-17","quoted_scripture":"\"Honor thy father and thy mother, that thy days may be long ....\"","citation":" Exodus 20:12 (KJV)","body_text":"I called my father the day before Father's Day to wish him a happy holiday. I told him of my well-being and also asked about his. We live more than 100 miles apart, but I love my father very much and show it every opportunity I can. My dad provided an excellent example to me of working hard and showing his concern and love for me.\r\n\r\nWhen we think of the word \"father\" in respect to the holiday known as Father's Day, do we remember to show him honor and respect and love he deserves? More importantly, do we as believers show honor, love, and respect and reverence toward our heavenly Father? If one is a believer and follower of Jesus Christ, the Lord showed us we do indeed have a Father who is in heaven who cares for us (see Matthew 6:9-34). Our God loves us and cares very much for us, just as our earthly fathers love and care for us.\r\n\r\nNot only on Father's Day, but every day, let us show our earthly fathers and our heavenly Father the love, respect, and honor they should receive; there is a special blessing for doing this.\r\n","thought_for_the_day":"Have I shown to my father on earth and my Father in heaven their honor, love, and respect today?","prayer":" Lord, each day and always, I want to honor You as my Father in heaven; I want to reverence You and love You. I want to always remember to honor, love, and respect my earthly father as well. Amen.","prayer_focus":"To have a good relation with our father on earth and our Father in heaven.","notes":"","previously_published":false,"id":"1426186960978","submission_author":{"email_address":"hot-rod@embarqmail.com","name":"Roger Brannon ","legal_name":"Roger Brannon","gender":"male","mailing_address":"274 Ross Road, Apt 5E\r\nTallahassee, FL 32305","phone_number":"850-575-7952","bio":"n/a","honorific":"Mr."}}
