{"language":"en","theme":"Bible Story","title":"Gifts","long_reading":"Ephesians 2:4-10","quoted_scripture":"For by grace you have bee saved through faith...it is  gift from God.","citation":"Ephesians 2:8 (NRSV)","body_text":"\"But God, who is rich in mercy, out of the great love with which he loved us even when we were dead through our trespasses, made us alive together with Christ—by grace you have been saved— and raised us up with him and seated us with him in the heavenly places in Christ Jesus, so that in the ages to come he might show the immeasurable riches of his grace in kindness toward us in Christ Jesus. For by grace you have been saved through faith, and this is not your own doing; it is the gift of God— not the result of works, so that no one may boast.  For we are what he has made us, created in Christ Jesus for good works, which God prepared beforehand to be our way of life.\"  Ephesians 2:4-10\r\n\r\nHow have you been made alive together with Christ this week?  Every Sunday, during the seasons that are not Lent, we hear these words, or similar words, as part of the absolution - the corporate forgiveness of sins.  What helps us to be alive in Christ is that \"by Grace we have been saved.\"  \"What is Grace?\" you may ask.  Grace is a gift - it is Jesus going to the cross to die for us so that we can be made right with G*d.  There is nothing we can do to earn such grace - as I said it is a gift.  It was given freely to us.  \r\n\r\nSo what do we do with gifts?  We open them - we take time to assess what they might mean to us, how valuable they might be to us - and then we put them to use.  If we get a cheap flashlight from a dollar store, we may find that we do not cherish that gift very much, and if it breaks, we most likely will discard it.  But if we get a gift that is priceless, or at least very, very expensive, then we treat it with care, we protect it, and if it is damaged, we spend the money to get it fixed.  \r\n\r\nRecently I received the gift of an \"OOga\" horn.  What is that?  It is one of the old horns that was on a Model A or T car.  It has a lever on the top of the horn that you depress and you get that classic \"OOOOOGA\" souund.  The gift came from my parents.  It may not be worth much to some people, but to me it is priceless.  When my father had the horn, it did not work - it was broken.  He either worked on it himself, or he had someone else work on it, took it completely apart and reassembled it, and now it works beautifully.  This gift connects me to my parents: it comes from my past, and more imprtantly it connects me to the now, and so the gift is priceless.\r\n\r\nThe greatest gift we ever received was the cross of Jesus Christ, who died for us so that we all may be saved.  The cross connects you and me to G*d, it connects us to the past, but is ever-present in the now.  If this gift means something to you, the gift of the cross of Jesus Christ and your relationship with him, cherish this gift: take time this Lent to repair it - if it is broken; to protect it, if you have been careless with it; and to show that you value it, if you have been taking it for granted.  \r\n\r\nPastor Dave\r\n","thought_for_the_day":"There is nothing more comforting than knowing that God's gift of Grace is dependent only on faith.","prayer":"Lord, you love us so much that you gave us your Son, your only Son, Jesus Christ.  He died for our salvation because we could not make our relationship with God right without him.  Help us to cherish the gift of Jesus each and every day - and to live out our faith lives in service to others.","prayer_focus":"Those who have been hurt or displaced by their church.","notes":"","previously_published":false,"id":"1426868320488","submission_author":{"email_address":"revschreff@hotmail.com","name":"Rev. David J. Schreffler","legal_name":"David J. Schreffler","gender":"male","mailing_address":"52 Bourbon Red Drive\r\nMechanicsburg, PA  17050","phone_number":"717-795-9343","bio":"Pastor at Trinity Lutheran Church, Lemoyne, PA for four years.  Ordained through the Evangelical Lutheran Church in America in 2005.  Married to Fritzi Schreffler and has three children: Steven, Matthew and Leah.","honorific":"Mr."}}
