{"language":"en","theme":"Bible Story","title":"Always Be Ready","long_reading":"1 Peter 3:13 - 16","quoted_scripture":"Always be ready to make your defense to anyone...","citation":"1 Peter 3:15 (NRSV)","body_text":"\r\n\r\n\"Always be ready to make your defense to anyone who demands from you an accounting for the hope that is in you...\" 1 Peter 3:15\r\n\r\nI have talked about \"relational evangelism\" before - evangelism that happens  because one person is willing to share their encounters with Jesus with someone else - usually someone they know.  A good example is what happens when Jesus comes to Philip and Philip runs to tell Nathanael.  (John 1:45)  We look to Philip's response and we wonder how we could do the same - be so willing and so compelled to tell anyone we encounter about our relationship with G*d, or about something that is happening in our church, or about our faith story.  \r\n\r\nWe all have a faith story.  What is yours?  While I was in Seminary, we were constantly asked to write about and to tell our classmates and congregations where we were invited to tell our faith story.  It became a story we knew so well it rolled off our tongues with such ease.  It became such an easy story to tell because we were compelled to tell it often.  And that is how telling our story becomes second nature to us.  I have often compared it to learning how to juggle.  I was a child who needed to entertain myself a lot because I did not have many friends.  So, one day I watched someone on television juggling, and I decided I was going to learn.  And for the next many, many hours and days I practiced and practiced until I taught myself to juggle.  Juggling is not something you can learn to do by watching others juggle.  You have to do it to learn it.  The same is true with proclaiming to others why your faith matters in your life.  These experiences form and inform our faith.  But we have to practice putting them into stories and into words so that we can proclaim them to others.\r\n\r\nAnd practicing them and telling them makes that whole process easier over time.  Find someone today, a friend, a fellow church member, a family member, and tell them your faith story.  Practice it - so that, when the opportunity presents itself, you will be ready to share it with someone who needs to hear how Jesus has changed your life.  It may just change their life...\r\n\r\nPastor Dave\r\n","thought_for_the_day":"Practice telling your faith story, for you never know when someone will need to hear it.","prayer":"Lord, you come to us in so many ways, through so many people.  Our faith lives are informed by the stories of your love, expressed through others, and in your interactions in our lives.  Help me to tell my story to others - for so many need to hear it.  Amen","prayer_focus":"People who love to tell the story.","notes":"","previously_published":false,"id":"1426869251800","submission_author":{"email_address":"revschreff@hotmail.com","name":"Rev. David J. Schreffler","legal_name":"Dvid J. Schreffler","gender":"male","mailing_address":"52 Bourbon Red Drive\r\nMechanicsburg, PA  17050","phone_number":"717-795-9343","bio":"Pastor at Trinity Lutheran Church, Lemoyne, PA for four years.  Ordained by the Evangelical Lutheran Church in America in 2005.  Pastor Dave is married to Fritzi and they have three children, Steven, Matthew, and Leah.","honorific":"Mr."}}
