{"language":"en","theme":"God's Love","title":"Nothing Can Separate Us From the Love of God","long_reading":"Romans 8:28-39","quoted_scripture":"This is love: it is not that we loved God but that he loved us and sent his Son as the sacrifice that deals with our sins.","citation":"1 John 4:10 (CEB)","body_text":"I am a pastor. In my sixth year of my ministry I went through a divorce. The divorce was complex due to the suffering, shame and despair I lived through for several years.  During this painful experience I came to know God's miraculous grace first hand.  God's unconditional love was evident in the support of my family, friends and the church I served. Thanks to this unconditional love, I was able to continue with my pastoral  responsibilities throughout the divorce process.\r\n\r\nI found healing from that experience and continue to serve as pastor. God restored me and gave me a new perspective to serve as an instrument of his grace to others.  God used this experience to help me be slow to judge and quicker to show love.  I learned that God expects us to love others as God loves us: unconditionally.\r\nNothing can separate us from the love of God, not our failures or our flaws.\r\n\r\nI am living proof of the healing God can bring through grace. I have a loving wife with whom I have established a wholesome marriage.  In my heart I have only gratitude because this has been a gift from God.  God's unconditional love heals, restores and makes all things new.\r\n","thought_for_the_day":"God's grace heals.","prayer":"Thank you, God, for your unconditional love.  Help us to love others the same way you love us: unconditionally.  Amen.\r\n","prayer_focus":"Pastors going through divorce","notes":"","previously_published":false,"id":"1426278353289","submission_author":{"email_address":"beaglemelo@gmail.com","name":"Eric Hernández","legal_name":"Eric Hernández","gender":"male","mailing_address":"38 Vista Verde\r\nCamuy, PR 00627","phone_number":"","bio":"n/a","honorific":"Mr."}}
