{"language":"en","theme":"God's Love","title":"n/a","long_reading":"Psalm 52:8","quoted_scripture":"For the LORD is good; his steadfast love endures forever, and his faithfulness to all generations.","citation":"Psalm 100:5","body_text":"The dark morning weather was harsh. I shuffled to the front door to get the morning newspaper that is delivered to my home each morning at 5:30 A.M. Winter had been long and dreary.  I snatched the Tribune off the step and returned to the lights of the kitchen where I remarked \"You can really count on her.\"  My wife responded to my comment about the papergirl with \"that is the best thing that you can say about anyone.\"\r\nWe can REALLY count on God. He will be there when we need him and we can also count on his willingness to listen to us and consider our prayers.  We do not have to sit in silent wonder and try to anticipate the reaction we may receive as we deliver our thoughts and cares to God.\r\nGod is never in a bad mood or critical of our timing when we need help.  Iso wish the world would evolve into a realm of peaceful listeners.  God knows that there is a time to listen and a time to act.\r\nGod knows we need to listen more and talk less if we are to help make the world a better place. Give us the strength to \"bite our tongue\" and absorb the feelings embedded in the words that flow our way during meaningful conversation. We do not want anyone to wonder what kind of mood we are in as they await our response.\r\nIt is a great gift to be thought of as someone that others can \"count on.\"  It is a great gift to be considered a good listener.  Please God let us develop into good listeners that others can count on.  In order to be considered a good listener you must be available and approachable.  Who do you know that is more approachable and available than God? He is always there and accessible from anywhere!\r\n","thought_for_the_day":"Let us learn to count on you God and to be the type of person that others can count on.\r\n","prayer":"n/a","prayer_focus":"Those that wish to be dependable listeners","notes":"","previously_published":false,"id":"1426278644557","submission_author":{"email_address":"","name":"Mike Johnson","legal_name":"Mike Johnson","gender":"male","mailing_address":"Box 39\r\nFairfield, MT 59436","phone_number":"","bio":"n/a","honorific":"Mr."}}
