{"language":"en","theme":"Family Life","title":"Overwhelming Love","long_reading":"Psalm 103","quoted_scripture":"We love because He first loved us.","citation":"1 John 4:19 (NIV)","body_text":"I was ready for bed sitting in a chair, when Keri my oldest granddaughter, who was about two at the time, came bouncing in. She was returning from a day at the lake where she had been visiting her paternal grandmother. She jumped in my lap and we immediately began to exchange hugs and kisses. The next instant she was still, almost limp... relaxed and snuggled in my arms. I just sat there holding her, thinking of how much I loved her.\r\n\r\nMy daughter watching all this said, \"Mom, she's filthy! Why are you letting her sit in your lap? Can't you smell her?\" I had to admit the scent of her world...dirt, puppies, fishing, food, lake, and hard playing did permeated her little body as I held her. Somehow, it didn't matter to me. She didn't have to be clean for me to love her. She didn't have to be perfect. In fact, there was nothing she could do that would  make me love her any more or any less. There was nothing I wouldn't do for her. The love I felt for her at that moment was overwhelming.\r\n\r\nAs I sat there holding her, the word filthy, that my daughter used, brought to mind the verse from Isaiah 64:6; \"All of us have become like one who is unclean, and all our righteous acts are like filthy rags.\" As I thought about the verse,It was that moment that God flooded my soul with a new dimension of understanding. This unconditional love I felt for my granddaughter, is like the unconditional love my Heavenly Father has for me. I, like Keri had gone to Him filthy... but I, like Keri found love.","thought_for_the_day":"Do you believe God's love is unconditional?\r\n","prayer":"God, please give us deeper understanding of Your love. As we grow in understanding help us extend unconditional love to others. In the name of Jesus, Amen.","prayer_focus":"Those who feel unworthy of God's love","notes":"","previously_published":false,"id":"1426187251653","submission_author":{"email_address":"marshahoward@aol.com","name":"Marsha Howard","legal_name":"Marsha Howard","gender":"female","mailing_address":"13612 CR 3900\r\nAthens, TX 75752","phone_number":"","bio":"n/a","honorific":"Ms."}}
