{"language":"en","theme":"Christian Action","title":"Learning to Listen","long_reading":"Matthew 13:10-17","quoted_scripture":"\"Truly I tell you many prophets and righteous people longed to see what you see, but did not see it, and to hear what you hear, but\r\ndid not hear it.\"","citation":"Matthew 13:17 (NRSV)","body_text":"At a backyard graduation party this spring my aunt regaled the relatives with a story of answered prayer. She said during his sophomore year, her son a received varsity letter for football but that they did not have the funds to purchase a letterman jacket. Immediately they prayed about it. Within an hour the phone rang. The athletic director, who knew their financial circumstances, offered to purchase the expensive jacket. I marveled. Though I pray long, wordy prayers cannot remember a time that I felt prayer was answered in a loud, fast, \"Whoa!\" kind of way.\r\n\r\nLonging to feel \"heard\" by God in a big way, I began to wonder why I had not experienced this phenomenon. I realized rather quickly that in my over-scheduled life with its family, work, and civic responsibilities, I tended to neglect the listening part of prayer. I am unaware of my prayers being answered because as soon as I make my requests to God I say, \"Amen,\" and either fall asleep or return to the chaotic busy-ness of life. I am like one of those \"righteous people\" Jesus speaks of who long to hear but do not hear simply because I have neglected to listen.\r\n\r\nAs we celebrated with the graduate the commencement of the next phase of his life I realized that it was time for me to graduate from one-sided prayer to true conversations with God. To praise and to ask and then to listen and receive.\r\n\r\n\r\n","thought_for_the_day":"When I take time to listen, God in his faithfulness speaks to me.","prayer":"Lord, thank you for always listening to my prayers. Open my ears to listen and my heart to hear your response. In Jesus' name.","prayer_focus":"Those yearning to deepen their prayer experience","notes":"","id":"1426106556737","submission_author":{"email_address":"cheleheid@yahoo.com","name":"Chele Heid","legal_name":"Chele Heid","gender":"female","mailing_address":"754 Valley Way Road\r\nGreenwood, IN 46142","phone_number":"","bio":"n/a","honorific":"Ms."}}
