{"language":"en","theme":"Christian Action","title":"Honoring Those Who Mentor","long_reading":"1 Corinthians 1:4-9","quoted_scripture":"\"I give thanks to God always for you because of the grace of God which was given you in Christ Jesus.\"","citation":"1 Corinthians 1:4 (RSV)","body_text":"This letter to the Corinthians was written to people who Paul nurtured and grew in the faith. Though he was no longer their personal pastor he still cared about their spiritual journey. He cared about their welfare. When he heard that they had fallen away from God 1s teaching, he didn't brush them off since they were no longer his responsibility. He reminded them to be faithful and pleasing to God.\r\nEven if you are a new Christian, there were probably people who prayed that you would come to know Jesus. These were witnesses who led you forward to the start. The more we are in the faith, the more people there are who touch us and guide us in our spiritual walk.\r\nWe are not meant to grow in faith alone. We need to be joined to others who know us and accept us for the imperfect beings that we are. True relationships don't flourish in the twitter world of short phrases. This is why pastors encourage people to join a small group for nurturing and growth.\r\nI meet weekly with others for a Bible study and dinner. This gives us the opportunity to know each other personally and not only by a hand wave in or out of church. We have become prayer partners who help one another stay accountable and lift us up when times get tough.\r\n","thought_for_the_day":"The cloud of witnesses is not only in heaven","prayer":"Heavenly Father, thank you for the mentors and cheerleaders in our lives who help us grow closer to you. Let me do the same for others to draw them to you.","prayer_focus":"","notes":"","id":"1426106801892","submission_author":{"email_address":"TheWriteChris@usa.com","name":"Christine Henderson","legal_name":"Christine Henderson","gender":"female","mailing_address":"158 Blue Sage Lane\r\nCibolo, TX 78108","phone_number":"","bio":"n/a","honorific":"Ms."}}
