{"language":"en","theme":"Spiritual Disciplines","title":"Ash Wednesday","long_reading":"Joel 2:12-17","quoted_scripture":"\"I had heard of you [God] by the hearing of the ear, \r\nbut now my eye sees you;\r\ntherefore I despise myself,\r\nand repent in dust and ashes.\"","citation":"Job 42:5-6 (NRSV)","body_text":"During an Ash Wednesday service, it is traditional for the pastor to alternate between two different statements as he or she \"imposes\" the ash cross on the forehead of worshipers. The first is, \"Remember that you are dust, and to dust you shall return.\" The second is, \"Repent, and believe the Gospel.\" In my church's tradition, the thanksgiving over the ashes includes this petition: \"Grant that these ashes may be to us a sign of our mortality and penitence . . .\" Sin and death are not exactly popular topics in secular culture. For many non-believers, Ash Wednesday is seen as unnecessarily somber and pessimistic.\r\nWe believe however, that Ash Wednesday is a healthy response to the realities of life. No one can dispute that we all die. The reality of sin is obvious to anyone who follows the daily headlines. Ignoring or denying these truths do not make them go away.\r\nAs Christians we are not afraid to contemplate either our sin or our death. We have confidence in the power of God to give us victory over these two enemies. We are not afraid to confess our sinfulness, because we are confident in God's grace and forgiveness. We are not afraid to contemplate our own death because of our confidence in Christ's victory over the grave.\r\nWe experience Ash Wednesday as somber, but optimistic. It is a frank acknowledgment of our  condition, but with the promise of deliverance. Ash Wednesday allows us to face life as it really is, while having the mature love to remain gracious, grateful, and generous.","thought_for_the_day":"Ash Wednesday is somber but optimistic.","prayer":"Almighty God, you have created us out of the dust of the earth. Grant that ashes may be to us a sign of our mortality and penitence, so that we may remember that only by your gracious gift are we given everlasting life; through Jesus Christ our savior.","prayer_focus":"Those who have not found hope in Jesus Christ","notes":"","id":"1426018144690","submission_author":{"email_address":"pastormikemac@gmail.com","name":"Michael Macdonald","legal_name":"Michael Macdonald","gender":"male","mailing_address":"103 Fairway Drive\r\nBlack Mountain, NC 28711","phone_number":"","bio":"n/a","honorific":"Mr."}}
