{"language":"en","theme":"Testing and Growth Through Hard Times","title":"The Blame Game","long_reading":"n/a","quoted_scripture":"\"Do not consider the things of old. I am about to do a new thing; now it springs forth, do you not perceive it? I will make a way in the wilderness and rivers in the desert.\"","citation":"Isaiah 43:18-19","body_text":"As normal human beings, we want to blame something or someone for the things that go wrong in our lives. Especially tragedy. In the beginning blame and anger are a natural reaction.\r\nIts either human error or \"It was just their time.\" Sometimes that makes sense. Especially if a person has lead a full life. No matter what or how, its sad. Its ok to be sad. Sadness is normal.\r\nWhen tragedy, no matter what it is, happens to us, we tend to play the \"blame game.\" After all, \"something or someone\" has to be responsible.\r\nIn Jesus time, I would imagine the people who were lepers or disabled in some way, wondered why them, or just accepted their plight as part of their lives. He cured some of them, but not all.\r\nLife happens and sometimes its not fair! Does it make it easier to blame God or someone or something else? The real answers may not come in our life time.\r\nYears ago, I had a very debilitating stroke. Who or what was to blame? Should I have led my life differently? There was nothing wrong with my health. I was dealing with things just as anyone else would have. So, why me? Why now?\r\nOf course I had some angry moments! Of course I wanted to put the blame somewhere. But where; on who?\r\nGod is an easy target. It would be easy to blame Him. After all, doesn't He control all, know all? I couldn't. My faith in Him just didn't allow it. By grace and His care, I was still here, able to think and love and forgive. Because of Him I found other reasons to live. Isn't that what we have to do? Instead of self pity, I was given a chance to explore other avenues of my life; \" to stop and smell the roses.\"\r\nGod doesn't want us, with the short time we have on earth, to live with anger, blame and resentment. He doesn't want us to be bitter. If we can put these things aside, He will give us reasons to live fruitful and happy lives.\r\n","thought_for_the_day":"","prayer":"n/a","prayer_focus":"","notes":"","previously_published":false,"id":"1426280541492","submission_author":{"email_address":"gbabula@mydvox.com","name":"Gail Babula","legal_name":"Gail Babula","gender":"female","mailing_address":"107 Birchwood Terrace\r\nClifton, NJ 07012","phone_number":"","bio":"n/a","honorific":"Ms."}}
