{"language":"en","theme":"Spiritual Disciplines","title":"Why Pray?","long_reading":"1 John 5:14-15","quoted_scripture":"\"Ask, and it will be given you; search, and you will find; knock, and the door will be opened for you.\"\r\n","citation":"Matthew  7:7","body_text":"Prayer is a way to serve God . We pray because God commands us to do so. God determined the prayer as the way for us to find solutions to the numerous situations in our lives like: preparing to make big decisions; going through an immense tragedy; giving thanks for God's blessings; facing a disease; being worried about money; thinking that God left us; suffering because of the death of a beloved; getting the strength to overcome temptation; etc.\r\n\r\nPrayer should not be seen as our means of getting God to do our will on this earth, but as a mean of getting God's will done on earth. The wisdom of God in everything exceeds ours. In situations we do not know with certainty what the will of God is, prayer is the way to discern it. If Pedro had not asked Jesus to get him off the boat, he would have drowned in the water (Matthew 14:28 -29). If the Canaanite woman , whose daughter was possessed , had not prayed to Jesus, her daughter would have not been cured (Mark 7:26- 30). If the blind man of Jericho had not claimed to Jesus, he would have gone blind (Luke 18:35-43). God said that we often do not get what we want because we do not ask (James\r\n4: 2).\r\n\r\nIn a similar way, prayer is like sharing the Gospel with people. We do not know who will respond to the message of the Gospel until we preach it. The same happens with prayer: We will never see the results of a prayer that may be answered until we pray. A lack of prayer demonstrates lack of faith and lack of confidence in the word of God. We pray to demonstrate our faith in God, and to demonstrate that God will do as promised in his Word. Through praying God will bless our lives more abundantly than we can even ask or expect.\r\n","thought_for_the_day":"\"The prayer of the righteous is powerful and effective.\" (James 5:16)","prayer":"Eternal God, teach us how to ask you as we should and according to your will. May your name be glorified in our lives, as we believe in you, so that we always come to you in prayer. Amen.","prayer_focus":"Those who have difficulties to pray","notes":"","id":"1426018457008","submission_author":{"email_address":"","name":"(Sr. Deputado) Francisco de Castro Maria","legal_name":"Francisco de Castro Maria","gender":"male","mailing_address":"Assembleia Nacional\r\nAvenida do 1° Congresso do MPLA, N° 42\r\nLuanda--Angola","phone_number":"","bio":"n/a","honorific":"Mr."}}
