{"language":"en","theme":"God's Love","title":"Unending Love","long_reading":"John 13:1-17","quoted_scripture":"Before the Passover celebration, Jesus knew that his hour had come to leave this world and return to his Father. He had loved his disciples during his ministry on earth, and now he loved them to the very end. \r\n","citation":"John 13:1 NLT","body_text":"I saw my friend's name appear on my phone. For three years, we had pastored churches in the same town and had become fast friends. We hadn't talked recently, so I was anxious to catch up. But the news he shared wasn't what I wanted to hear. He had  suffered a seizure. Further testing revealed a brain tumor. Now he lay in a hospital bed awaiting radiation. The tumor was inoperable and the prognosis unfavorable. Often his type of tumor reveals the presence of cancer somewhere else in the body. But his spirits were high. Members of his church have been visiting. Men in the church have preached for him. Instead of turning their back on him because he can't perform his duties, the church has stepped up and demonstrated their love.\r\n\r\nWhen the news is bad or when tragedy strikes, it's tempting to question God or think he has forgotten me. I've heard many propose it's wrong to question God, but there is a difference between questioning God and asking God a question. Questioning God calls into question his love or actions in my life whereas asking him a question merely seeks information about why something has or is happening and how I should respond to it.\r\n\r\nGod's love is unending. Regardless of what touches my life, it has been filtered through the Father's hand and does not signal that he has stopped loving me. He loved me in the past, loves me in the present, and will love me eternally. The expressions of his love may sometimes baffle me, but he loves me nevertheless. I must simply learn to trust his love, mercy, and goodness, as well as the means he uses to expresses it.\r\n","thought_for_the_day":"When you're tempted to think God has stopped loving you, think again.\r\n","prayer":"Thank You Father for Your eternal love that holds us safely throughout our lifetime.\r\n","prayer_focus":"God's unending love","notes":"","previously_published":false,"id":"1426279387999","submission_author":{"email_address":"mandmwiles@gmail.com","name":"Martin Wiles","legal_name":"Martin Wiles","gender":"male","mailing_address":"133 Pin Oak Drive\r\nGreenwood, SC 29649","phone_number":"","bio":"n/a","honorific":"Mr."}}
