{"language":"en","theme":"Christian Action","title":"Enough","long_reading":"Judges 7:16-23","quoted_scripture":"And my God will meet all your needs according to the riches of his glory in Christ Jesus. \r\n\r\n","citation":"Philippians 4:19 (NIV)","body_text":"When my husband suggested we host a monthly gathering in our home, I laughed. He saw a need for young families in our community to have a time of connection and encouragement. All I could see was how we didn't have enough - space, time, energy, or money.\r\n\r\nWhen I overcame my fear of not having enough and allowed God to use us, He did great things. People made new friends, old friends reconnected, and we encouraged each other's faith through life's challenges.\r\n\r\nI can relate to Gideon's doubts that God could use him. \"O my Lord, how can l save Israel? Indeed my clan is the weakest in Manasseh, and J am the least in my father's house\" (Judg. 6:15). God showed Gideon that no matter how little you have, with His help, you have enough. With an army of just 300 men using trumpets, torches and pitchers, God gave Gideon victory over the much larger and stronger Midianite army. God wanted Israel to know success came from Him, not their own strength (Judg. 7:2).\r\n\r\nWhen God asks us to do something and we feel we don't have enough, we need to remember He is the one who supplies the strength and all that we need to do His work (see Phil. 4:13,19).\r\n\r\n","thought_for_the_day":"No matter how little you have, with God's help, you have enough.\r\n","prayer":"Lord, help to step out in faith today and serve you wherever you may ask. Help me to remember that I have all I need through your son Jesus.\r\n","prayer_focus":"Our community of friends and neighbors\r\n","notes":"","id":"1426167652149","submission_author":{"email_address":"amelia@ameliarhodes.com","name":"Amelia Rhodes","legal_name":"Amelia Rhodes","gender":"female","mailing_address":"11677 Barnsley \r\nLowell, MI 49331","phone_number":"","bio":"n/a","honorific":"Mrs."}}
