{"language":"en","theme":"Testing and Growth Through Hard Times","title":"God Proves Our Faith","long_reading":"Read Psalm 23","quoted_scripture":"Even though I walk through the darkest valley, I fear no evil; for you are with me; your rod and your staff -they comfort me.","citation":"Psalm 23:4","body_text":"One day, while reading in The Upper Room, this question captured my attention: \"What has God made that is very meaningful for you?\" From that moment on , I began to reflect on all the things the Lord has done for me. I realized that what God made more meaningful for me was to help me to get rid of a nightmare I had. I was sleeping and I suddenly woke up. The room was completely in the dark because there was no electricity in the house at the moment. Things seemed to have changed places and the door to my room was unrecognizable. It was then when I felt extreme fear.\r\n\r\nI ran to my mother. I told her the fear I felt. Both of us read the verse from Psalm 23:4: \"Even though I walk through the darkest valley, I fear no evil, for you are with me; your rod and your staff they comfort me.\" And we both prayed so that God gave me more courage.\r\n\r\nStrengthened by God's protection, I went back to my room and I could sleep peacefully. Often God wants to test our faith to know how much we believe in him, the same way he tested my faith.\r\n","thought_for_the_day":"Sometimes God wants to know how much we love him.\r\n","prayer":"Dear God , thank you so much for being our refuge in every moment of our lives. Be with us, give us strength, and take away our fear. In Jesus' name. Amen.\r\n","prayer_focus":"People dominated by fear\r\n","notes":"","previously_published":false,"id":"1426280051963","submission_author":{"email_address":"","name":"Laydiana Patrícia Adão","legal_name":"Laydiana Patrícia Adão","gender":"female","mailing_address":"A/C Igreja Metodista Unida Central\r\nRua Rev. Agostinho Pedro Neto, N° 4\r\nLuanda--Angola","phone_number":"","bio":"n/a","honorific":"Mrs."}}
