{"language":"en","theme":"Family Life","title":"WHEN BEING RIGHT IS WRONG","long_reading":"Luke 15: 28 - 32","quoted_scripture":"\"Be angry and yet do not sin; do not let the sun go down on your anger, and do not give the devil an opportunity.\"","citation":"Ephesians 4:26 - 27 (NAS)","body_text":"Mom and I had “words”.  We were angry with each other.  Each felt she was right.  We were at a stalemate.  There was nothing to do but go to bed, both of us in tears.  “Deb, you need to go make things right with your mother,” Jim stated flatly.  “But she’s wrong.  Can’t you see that?” I protested.  “It doesn’t matter who is right or wrong.  Your mom is hurting and so are you.  You can’t go to bed like this.  You need to go talk to your mom.”\r\n\r\nGod granted me the grace to listen to my husband (for a change) even though his directive totally conflicted with my emotional response, my righteous indignation.   I slipped into Mom’s bedroom.  She was lying on her side, crying into her pillow.  I crawled into bed beside her, put my arm around her, and muttered, “I’m sorry, Mom.”  She rolled toward me, returned the hug and began apologizing too.  The issue (I have no recollection as to what it was) no longer mattered at all.  What mattered was our relationship, the love we had for each other.  After a while, we kissed goodnight and I went down the hall to join Jim in bed – seeing in him the greater wisdom.   \r\n","thought_for_the_day":"How important is it for you to \"be right\"?","prayer":"Lord, remind us of what really matters in this life - our relationships, our actions.  Free us from the need to be right.","prayer_focus":"Family tensions","notes":"","previously_published":true,"id":"1426820867792","submission_author":{"email_address":"debraferalb@gmail.com","name":"Debra","legal_name":"Callaway","gender":"female","mailing_address":"7022 Bradshaw Ct, Shawnee, KS 66216","phone_number":"(913) 631-7092","bio":" I was born in Arkadelphia, Arkansas, in 1953.  I received a Bachelor’s of Art Education from Henderson State University, in Arkadelphia and then went on to earn a Masters of Fine Arts in painting from Florida State University in Tallahassee, FL.\r\n\r\nAfter a couple of years teaching high school art, I moved to Kansas City and took a position teaching language arts in an alternative high school for “at-risk” teens.  For the next 30 years, I taught English and devoted a lot of time to running and triathloning.  I competed in many marathons and other running events around the world and in the Hawaii Ironman World Championship Triathlon.  However, I did continue to paint when I could find the time and wrote daily in my journal.  I also benefitted from some writer’s workshops and peer editing groups.\r\n\r\nIn 2010 I retired from teaching and now spend most of my time writing or painting.  My husband and I also travel quite a bit, and I enjoy writing and painting on vacation as well.\r\n","honorific":"Ms."}}
