{"language":"en","theme":"Relationships","title":"The Greatest of These","long_reading":"Acts 1:6-11","quoted_scripture":"\"You shall receive power when the Holy Spirit has come upon you; and you shall be my witnesses ... to the end of the earth.\"","citation":"Acts 1:8","body_text":"By befriending a ninety-five-year-old woman in our community, my hope was to add joy to her days. I had much to learn.\r\n\r\nIn my frequent visits with her during the three years before her death, I learned that I had greatly overestimated what I could bring to her, and sorely underestimated what she had to offer me.\r\n\r\nEarly on, I felt a magical connection to her even though we were different in age, in race, in socioeconomic status, and in educational equivalence. And the greatest lesson I learned was that  none of this mattered.\r\n\r\nEach time she welcomed me into her home, she would maneuver her power-operated wheel chair close enough to hold my hands. I loved being within her reach as I savored the sweet gifts she offered me from her vast reservoir of spiritual insightfulness.\r\n\r\n\"The Lord has brought us together,\" she had said. \"The Holy Spirit has come upon us. That's the only magic in this room.\"\r\n\r\nOftentimes now, as I drive by her little empty house, I hear her untroubled voice saying again, \"We must read the Word, and we must live the Word.\"\r\n\r\nI know that she has received her crowning glory. I can best befriend her now by spreading abound the gifts she so graciously bestowed upon me.\r\n","thought_for_the_day":"Love one another.\r\n","prayer":"Dear Heavenly Father, thank you for those among us who bring us closer to Thee.  Give us the forbearance to live faithful to your Word.  Amen.\r\n","prayer_focus":"Those who serve the Lord","notes":"","previously_published":false,"id":"1426180208794","submission_author":{"email_address":"","name":"Dianne T. Evans ","legal_name":"Dianne T. Evans","gender":"female","mailing_address":"3174 Pageland Highway\r\nLancaster, SC 29720","phone_number":"","bio":"n/a","honorific":"Ms."}}
