{"language":"en","theme":"God's Love","title":"Like Mother, Like Father","long_reading":"Psalm 103:15-19","quoted_scripture":"But the steadfast love of the Lord is from everlasting to everlasting on those who fear him, and his righteousness to children's children.","citation":"Psalm 103:17 (ESV)","body_text":"When I was one year old, my mom wrote me a letter and sealed it in an envelope. Sixteen years later, after yet another displeasing day of high school, I came home to find a small blue envelope, dated 1995, left on my desk.\r\nThe three pages of journal paper were tinged yellow with age and were the texture of rose petals. I teared up as I read through my mother's joyful record of the first year I began to explore the world. She had confessed her love and pride for me even before I could even crawl. Though I was a grown teenager, my mom's letter made me feel like a little, bright-eyed boy again.\r\nEighteen years after the first, my mom wrote me another letter, left on the desk of my new dorm room at college. The envelope was crisp and bright and the handwriting had changed, but her love and pride for her little boy had not.\r\nI realized then that my mom loves me like my Heavenly Father loves me. I know I've failed in my relationship with my mom over the years, and how much more have I failed to bring glory to God? Yet, both He and my mom continue to love me, showering me with undeserved grace.\r\nThe world will constantly change and eventually fade away, but God's love for his children outlasts all things. His Word promises that we are loved regardless of the sin in our lives, which is the greatest love letter of all.\r\n","thought_for_the_day":"Children of God are never unloved.\r\n","prayer":"Heavenly Father, I know the world will constantly change and eventually fade away, but You outlast all things. Be my steady companion and guide as I navigate this twisted life. Amen.\r\n","prayer_focus":"Those without loving, earthly parents\r\n","notes":"","previously_published":false,"id":"1426278134714","submission_author":{"email_address":"writeandwrong@live.com","name":"Jeff Grogan","legal_name":"Jeff Grogan","gender":"male","mailing_address":"1001 Harbury Drive\r\nCincinnati, OH","phone_number":"","bio":"n/a","honorific":"Mr."}}
