{"language":"en","theme":"Christian Action","title":"An Angel in Disguise?","long_reading":"James 2:1-3 and Hebrews 13:1-3\r\n","quoted_scripture":"\"A good tree cannot bear bad fruit, and a bad tree cannot bear good fruit ...Thus, by their fruit you will recognize them.\"\r\n","citation":"Matthew 7: 18, 20 (NIV)\r\n","body_text":"Frank lives in a tent by the airport. He is 67, homeless, and keeps to himself. People avoid Frank due to his situation and rough image. They misjudge him. I did, but over time I've gotten to know Frank. He has a kind and generous heart.  He takes care of a homeless woman and her cat who live nearby. He feeds the birds and squirrels who live around him. Frank just might be an angel in disguise.\r\nIt's too easy to make quick conclusions and so misjudge others. We notice the outward things: their clothes, where they live, how they talk. But Jesus told us how to evaluate the character of another person-by their \"fruit.\" Good trees have good fruit.  But fruit takes time to develop, so we can't be quick to judge. Over time we will get to know others by the life \"fruit\" that the Holy Spirit grows in us over time. The apostle Paul says that fruit is \"love, joy, peace, patience,  kindness, goodness, faithfulness, gentleness and self-control\" (Gal. 5:22,23, CEB).\r\nBy being slow to judge and allowing time to see real fruit develop, we may discover the angels all around us.\r\n","thought_for_the_day":"With everyone I meet today, I will look beyond the outward circumstances to discern their character.\r\n","prayer":"Thank you God for all those amazing \"angels\" all around us that bless us and make life worth living. Use each of us as an angel to someone today.  Amen.\r\n","prayer_focus":"Those who are homeless","notes":"","id":"1426107055644","submission_author":{"email_address":"info@thechristianjournal.org","name":"Chad McComas","legal_name":"Chad McComas","gender":"male","mailing_address":"1743 Alcan \r\nMedford, Oregon 97504","phone_number":"","bio":"n/a","honorific":"Mr."}}
