{"language":"en","theme":"Bible Story","title":"Living a Larger Life","long_reading":"Matthew 5:1-12","quoted_scripture":"\"They will bear fruit even when old and gray; they will remain lush and fresh in order to proclaim: 'The LORD is righteous. He's my rock. There's nothing unrighteous in him.'\"","citation":"Psalm 92:14-15 (CEB)","body_text":"I met Ava in an assisted living facility. She embodied the vision of the Psalmist that even in our old age, God leads us to love.\r\nAva had spent her working life as a seamstress. Even in her nineties, she could turn gifts of fabric into beautifully crafted blouses and skirts  or trousers and shirts for homeless girls and boys. She exuded joy as she worked. I liked being around her.\r\nWhen Ava's hands got too stiff to sew and her eyes too dim to see well, she was deeply downcast. She looked up one day. She noticed that the small packets of crackers beside each place in the dining room often went uneaten and were discarded. She began to collect the packets.  Friends in her community noticed and began to save them for her. When she filled a bag, she would call a church member to take it to the community food pantry.\r\nOne day a nearby resident, in a fit of sudden anger, crumpled a cracker packet into crumbs and threw it in Ava's direction with a scornful screech, \"Why do you care? You're old now. It's time to look out for yourself!\" \r\nAva just smiled and kept on collecting crackers and passing them on. Hers was a practical, hands-on faith. She is gone now, but she remains an example of moral leadership for me and all who loved her.\r\nI won't forget her lesson: \"Just look at what's right in front of you, and you'll find away to help someone in need.\"\r\n\r\n","thought_for_the_day":"","prayer":"Dear God, help me see your world and people with eyes wide open. Grant courage, that as long as I am able, I might offer what I can where there is need of it. Amen.","prayer_focus":"Moral leadership and old age","notes":"","id":"1426104890439","submission_author":{"email_address":"","name":"Rev. Carol J. Allen","legal_name":"Carol J. Allen","gender":"male","mailing_address":"899 South Plymouth Court, #1707\r\nChicago, IL 60605","phone_number":"","bio":"n/a","honorific":"Mr."}}
