{"language":"en","theme":"God's Love","title":"God Thinks About Me","long_reading":"Read Psalm 40:16-17\r\n","quoted_scripture":"\"As for me, I am poor and needy, but the Lord takes thought for me.\" \r\n","citation":"Psalm 40:17a (NRSV)","body_text":"When I was a child, my dad managed a restaurant. Since he was the boss he had the keys to the business and could enter the building any time he wanted to. Occasionally, on Saturday mornings, I would go to work with him before the restaurant opened to the public. My dad would ask one of the cooks to serve me breakfast and because I was the boss' daughter, they made sure to serve me the best breakfast including the largest and freshest cinnamon roll. It felt special to be the only customer in the restaurant and to be served by the cook, but that privilege only came because I was the daughter of the boss. I was closely related to the manager, the one with the keys, the one in charge, the one who cared about me.\r\nGod is in charge of the universe. He created the Earth, the sky, the stars and all the planets. God fashioned the man and the woman, the smallest atom and the largest whale. God, who is in charge of everything, thinks on me. God, who is the boss of everything, understood my poverty and my neediness and adopted me as a daughter. As a daughter, when I call upon God I can count on an\r\nanswer. A father does not ignore their offspring. When I ask my Father for help, I know I will be helped. I can praise and thank God for thinking about me. I can rejoice in my Father's care.","thought_for_the_day":"Children know the care of a father and a father cares for their children.\r\n","prayer":"God, thank you for thinking about me and considering me as one of your children.","prayer_focus":"Those who wonder if God cares","notes":"","previously_published":false,"id":"1426278878644","submission_author":{"email_address":"pbcdbtm@hotmail.com","name":"Terese Luikens","legal_name":"Terese Luikens","gender":"female","mailing_address":"329 North Lincoln\r\nSandpoint, ID 83864","phone_number":"","bio":"n/a","honorific":"Ms."}}
