{"language":"en","theme":"Spiritual Disciplines","title":"Reading God's Word","long_reading":"Romans 10:8-13","quoted_scripture":"\"All Scripture is inspired by God and is useful for teaching the truth, rebuking error, correcting faults, and giving instruction for right living, so that the person who serves God may be fully qualified and equipped to do every kind of good deed.\" ","citation":"2 Timothy 3:16-17 TEV\r\n","body_text":"As we go through life, we often hear people say that they believe in the habit of reading their Bible early in the morning, and it shapes their minds and their actions for the entire day.\r\nI have not always practiced this habit, but it is such a part of me now that I feel compelled to reach for my Bible and Upper Room as soon as I awaken. It is a habit, but one I anticipate with great joy; it is the best part of the day. When my Bible was new many years ago, I did not write in it because I wanted it to retain its newness. Now my Bible is worn and contains many notes in the margins and is underlined on many pages, but that doesn't mean I need a new Bible. I frequently underline sentences and paragraphs that are especially meaningful to me. When I happen upon those words that I have underlined, I read them and feel God speaking to me again.\r\nSomeday when I am no longer here, my sons or grandchildren may find my Bible and read the words that I have marked, and may gain insight into God's special love for them, they may hear his voice speaking to them; and in this way my love for God's Word will be an example to them, even after my earthly life is done. The prayer below is one that I pray every day before I begin my reading.\r\n","thought_for_the_day":"Today I will start the day with God's Word.","prayer":"Lord, open my heart and my mind to the power of your Word, that as I read, I may know, understand and obey what you say to me today. In Jesus' name, amen.","prayer_focus":"Those who do not have Bibles","notes":"","id":"1426021768547","submission_author":{"email_address":"jandlmoran@bellsouth.net","name":"Lynn Moran","legal_name":"Lynn Moran","gender":"female","mailing_address":"6044 Alabama Hwy 259\r\nAlexander City, AL 35010","phone_number":"","bio":"n/a","honorific":"Ms."}}
