{"language":"en","theme":"Spiritual Disciplines","title":"How Hard to Wait","long_reading":"Luke 18:1-8","quoted_scripture":"\"For in Him does our heart rejoice, because we have trusted (relied on and been confident) in His holy name. Let Your mercy and loving-kindness, Oh Lord, be upon us, in proportion to our waiting and hoping for You.\"","citation":"Psalms 33:21-22 (Amplified)\r\n","body_text":"One of my close Christian friends recently related a quick answer to prayer she received. After hearing about her experience, I found myself not glad for her, but jealous. For over a year now, I had searched for a new job, and one was not forthcoming. I couldn't discern why God was not in a hurry to move me from my current position. Why did my friend have a quick answer, while I waited?\r\nAfter looking to my Bible for answers, I realized many people before me waited. David waited years to become King. The people of Israel waited to find their promised land. Joseph and Mary waited to see how their son would save the world. The disciples waited and followed even though they could not comprehend what was happening or what the true outcome would be. God also calls upon us to wait. We do not know the what, where and why of how our Lord works, but He does promise that whatever it is will be for our good, that all things will work together to those who love God and to those who are called according to His purpose.\r\n","thought_for_the_day":"Trust in God during your waiting period.","prayer":"My Lord, how difficult it is to wait for your will! I pray you will give me an attitude of peace and gratefulness for the blessings you have shown me and the stamina to wait on you even in the toughest of situations. Amen.","prayer_focus":"People waiting on answers.","notes":"","id":"1426015100304","submission_author":{"email_address":"suemidd48@yahoo.com","name":"Sue Fairchild","legal_name":"Sue Fairchild","gender":"female","mailing_address":"Watsontown, PA","phone_number":"","bio":"n/a","honorific":"Ms."}}
