{"language":"en","theme":"Family Life","title":"Before We call","long_reading":"Matthew 7:8-11","quoted_scripture":"Before they call I will answer; while they are still speaking I will hear.","citation":"Isaiah 65:24 (NIV)\r\n","body_text":"I was quickly cleaning up in the kitchen; putting the dishes away. My mind was reviewing the chores I wanted to do before my baby daughter awoke from her nap. l knew when she woke up that her diaper would be wet, she would be cold and hungry. The only way she could tell me about her needs would begin with restlessness and progress to crying. I was watching the time as I worked, intently listening for her to stir. When that happened, I would walk down the long hall to her room before her cries progressed to wailing. The new dry diapers, were in her room. Once she was changed  I would hold and feed her. I loved my baby and would do anything for her. The problem was my daughter didn't know any of this. She was blissfully asleep in her bed in her own little world. As I continued my work, I suddenly realized how I was just like my baby daughter. Living in my own little world, until what I considered a crisis would happen. I would become frantic and begin wailing to God about my needs and concerns. Yet, His ear was already attuned to my crying and what I needed. He already had things in place to assist me whatever the problem before I even called to Him. Thanks be to God for hearing and caring for all of us.\r\n","thought_for_the_day":"","prayer":"Dear God, You are amazing that you would care for each of us better than any parent; that your love is attuned to our needs before we even know what our needs are. Thank you for hearing us. Amen.","prayer_focus":"Parents of young children","notes":"","previously_published":false,"id":"1426277839326","submission_author":{"email_address":"donnadoc@hotmail.com","name":"Donna Trimm","legal_name":"Donna Trimm","gender":"female","mailing_address":"2605 Mountain Drive\r\nMcGaheysville, Virginia 22840","phone_number":"","bio":"n/a","honorific":"Ms."}}
