{"language":"en","theme":"Spiritual Disciplines","title":"n/a","long_reading":"n/a","quoted_scripture":"\"Ask, and it shall be given you; seek, and ye shall receive; knock and the door will be opened to you.\"","citation":"Matthew 7:7","body_text":"Starting from  11 o'clock our house off the lights, the afternoon I was thinking maybe this is just a temporary outage but when the neighbor beside our house lights blazing. I wondered why the lights in our house would not go on. I then report this complaint to PLN Services Engineering 24 hours. And once in my data sent home. I waited 2 hours and my wife asked me to inquire into the PLN whether there was follow-up. PLN told that my report is being processed and officers are leaving for my home. I waited 2 hours and the PLN officers did not come, then I went back there and ask why PLN officers did not come. They explained that they give priority to repair the main substations first and after that they were to place me.\r\n\r\nI ponder these events, often we pray not to have perseverance in expecting an answer to prayer. When our prayers are not answered, we are getting lazy to pray and began to lose hope. I am reminded of the story of a widow who appeal to the unjust judge that the widow was constantly asking for justice to an unjust judge it to the same repetitive I ask justice to the PLN to turn on the lights. And I saw when diligently, unjust judges and even then had to answer the case of the widow as well as the PLN is finally turned on the lights in our house.\r\n","thought_for_the_day":"Unjust judge just would not want to answer the case of the widow let alone us children of God which our Father in Heaven surely answer our needs.","prayer":"Lord Jesus, forgive us who sometimes are not diligent in prayer asking to You, Your Word says if we ask, we will obtain, if we are looking for then we will find and if we knock the door will be opened to us.  In the name of Jesus. Amen.","prayer_focus":"People are getting lazy Christians to pray","notes":"This meditation c/o Google Translate, originally submitted in Indonesian.","id":"1426104357297","submission_author":{"email_address":"yantow08@gmail.com","name":"Yanto Wijaya","legal_name":"Yanto Wijaya","gender":"male","mailing_address":"Indonesia","phone_number":"","bio":"n/a","honorific":"Mr."}}
