{"language":"en","theme":"Spiritual Disciplines","title":"Praying for Each Other","long_reading":"Luke 18","quoted_scripture":"\"Pray in the Spirit on all occasions with all kinds of prayers and requests. With this in mind, be alert and always keep on praying for all the Lord's people.\"","citation":"Ephesians 6:18","body_text":"During the worship service on Sunday, the pastor encouraged the congregation to pray for a person sitting next to them. At the end of the aisle I saw a boy sitting beside his single mother.  Just then, a tall young man walked down the aisle in pursuit of someone\r\nto pray for. I reached out to touch his arm as he passed by and pointed to the little boy. He turned and approached the boy.\r\nBending down on one knee, the young man looked into the boys' face.  Someone looking on might have taken them for brothers, but by their body language I knew they didn't know each other. While the young man prayed a short prayer, the mother nodded her agreement.  He then uncurled his large frame and walked away missing the mother's mouthing a \"thank you\" and the beaming face of a boy who seemed to be standing just a little bit taller.\r\nPrayer is powerful. Anyone can be used by God , simply by allowing the Holy Spirit to work though them. Sharing burdens through prayers of faith and petitioning God on behalf of others can change lives. When we pray with and for another, a special anointing from God settles in our hearts to bring faith and hope. We have become ambassadors of God's love.\r\n","thought_for_the_day":"Whenever I pray for myself, I will remember to pray for someone else as well.\r\n","prayer":"Heavenly Father, on behalf of all the hurting and lonely people of this world we pray that you will protect them their faith and hope in you. Amen.","prayer_focus":"","notes":"","id":"1426104034735","submission_author":{"email_address":"jodiaince@yahoo.com","name":"Jodiann Schott","legal_name":"Jodiann Schott","gender":"female","mailing_address":"1211 South Wall St.\r\nSpokane, WA 99204","phone_number":"509-844-6945","bio":"n/a","honorific":"Ms."}}
