{"language":"en","theme":"Christian Action","title":"Stirring Things Up","long_reading":"Proverbs 15:1-2","quoted_scripture":"\"As churning cream produces butter, and as twisting the nose produces blood, so stirring up anger produces strife.\"","citation":"Proverbs 30:33 (NIV)","body_text":"Recently, I had a very unpleasant experience at work. My boss falsely accused me of wrong actions. No matter how I defended myself, my words didn't seem to have any effect. He disregarded my opinion and said things that hurt my feelings. I remember my face growing hot and wanting to lash out with angry words. I then realized that acknowledging my feelings may have been fine but that my response to those feelings could harm him as much as his words had harmed me.\r\nThen I had an idea: instead of lashing out, I could express the anger I was feeling to the Lord in a time of quiet prayer and reflection. Talking over the hurt with God helped calm me down. I saw that I needed to rely on His power to give me strength not to react when someone else hurts me. I remembered a verse from the Bible that tells me that a gentle answer turns away anger (Prov. 15:I). I decided that the next time someone hurts me with their words I will bring my frustrations to God and search for something kind I can say in return to that person.\r\nWhen our feelings have been hurt, most of us will want to speak back in anger. God instead encourages us to withhold our anger and not reply in kind. Stirring up anger produces strife, but we can break a cycle of anger with our gentle-and godly - response.\r\n","thought_for_the_day":"Words are powerful. Use them wisely.","prayer":"Dear God, help me listen to my words before I speak them out loud, so that what comes out of my mouth will encourage others. Amen.\r\n","prayer_focus":"Those who give vent to their anger","notes":"","id":"1426106082592","submission_author":{"email_address":"tom@tomfuller.net","name":"Tom Fuller","legal_name":"Tom Fuller","gender":"male","mailing_address":"3300 Morris Street\r\nNewberg, OR 97132","phone_number":"503-550-4067","bio":"n/a","honorific":"Mr."}}
