{"language":"en","theme":"Personal Relationship with Christ and Salvation","title":"Exercise","long_reading":"Romans 3: 21-26","quoted_scripture":"Righteousness from God comes through faith in Jesus Christ.","citation":"Romans 3: 22 (NIV)","body_text":"Daily I engage in an exercise designed to enhance the core of my physical being. It involves lying on your back on a semi rigid cylinder \u0026 alternatively raising an arm straight up \u0026 pulling up the opposite leg into a bent position. Such action creates the need to maintain balance on the cylinder thereby theoretically improving your core being.\r\n\r\nRecognizing that the activity is designed to improve my physical wellbeing, I came to realize there’s also a spiritual aspect to my exercise movements. As I reach toward the ceiling in my exercise space I also need to reach out on a ongoing basis to God the Father. He desires to be in our lives \u0026 stands ready to welcome us into a close personal relationship. We, however, need to take steps to enter that relationship by actively reaching out to Him. We can do that thru our acceptance of Jesus Christ as our personal Savior \u0026 by striving to adhere to His teachings. \r\n\r\nPhysical \u0026 spiritual wellbeing is readily available. Attaining it requires our reaching out to the available sources. \r\n","thought_for_the_day":"Actively seek God \u0026 He will unite with you.","prayer":"Father God, thank you for your eternal love \u0026 compassion. Help us to constantly seek closeness with you. Amen.","prayer_focus":"Thanking God for His eternal presence \u0026 love for us.\r\n\r\n","notes":"","previously_published":false,"id":"1426780552042","submission_author":{"email_address":"garth40@bellsouth.net","name":"Garth Radley","legal_name":"Garth Radley","gender":"male","mailing_address":"4017 Bellingham Lane - Charlotte, NC - 28215","phone_number":"704-597-5551","bio":"Retired insurance company executive. Elder in Assoc. Reformed Presbyterian Church. Active in local university international student support.","honorific":"Mr."}}
