{"language":"en","theme":"Bible Story","title":"God is Good","long_reading":"John 9:1-7","quoted_scripture":"\"God is love. Whoever lives in love, lives in God, and God in him.\"","citation":"1 John 4:13 (NIV)","body_text":"\"How are you?\" After my knee replacement, I hated that question. If I answered with honesty, hesitations followed as my friends tried to console me. I decided to try different responses including: \"Better than yesterday.\" \"I'm out of bed and alive.\" Then, one morning as I read my Bible, I thought of a different type of response, one that would include God. The next time a friend asked, \"How are you?\" I replied, \"God loves me and has given me another great day.\" She looked at me, smiled and gave me a hug. Encouraged, I gave a similar reply to the next person who asked the dreaded question. \"Me too,\" she said. \"What a great answer!\" It's still hard not to say what everyone expects as a reply to this commonly asked question, but the more I give a better one, the more it becomes natural for me to do so.\r\n\r\nIn John 9, Jesus rejected the idea of an angry God who punishes us. He assured his disciples that a man did not suffer from blindness because he or his family had sinned.\r\n\r\nMany times I don't understand why there seems to be no justice in my life, but God did not promise we would be free of hardship. Even in the middle of physical or mental suffering, prayer and a positive attitude help me remember that God is good.\r\n\r\n","thought_for_the_day":"Positive words help us to praise God and to remember that He is good.\r\n","prayer":"Dear God, We know you are always with us, even when life is difficult. Help us to accept whatever comes and to remember to continue to praise you. Amen.","prayer_focus":"Praising God in difficult times","notes":"","id":"1426168017595","submission_author":{"email_address":"nanshel@yahoo.com","name":"Nancy Shelton","legal_name":"Nancy Shelton","gender":"female","mailing_address":"1530 E. Erie, 214F\r\nSpringfield, MO 65804","phone_number":"","bio":"n/a","honorific":"Mrs."}}
