{"language":"en","theme":"Spiritual Disciplines","title":"A Quiet Place","long_reading":"Luke 6:12-15","quoted_scripture":"\"Jesus got up, left the house and went off to a solitary place, where he prayed.\"","citation":"Mark 1:35 (NIV)","body_text":"E.B. looked at a pamphlet with pictures, describing a river in Michigan.  It appeared to be tranquil, a nice smooth body of water that would be perfect for canoeing with his family. So, they made plans and expectantly set out for their destination.\r\nThe family was divided into two canoes; each canoe having an experienced guide in it.  It wasn't long until fallen trees began appearing in the water, making it necessary to paddle around them.\r\nIn one place, a very large tree had fallen across the river. There didn't seem to be a way of getting around it. The guides maneuvered the canoes into a quiet place while they surveyed the problem they faced and then took time to look for a solution. Eventually, the canoeists found a way around the tree and finished their course.\r\nAt times, it may seem that it's not only one tree blocking our passage on the river of life, but a log jam that looms before us! It seems impossible for us to move forward. Those are the times when we need to find a quiet place and allow our Lord to guide us.\r\nMany times we read in the New Testament that Jesus went to a quiet place to have communion with his Father. He knew that it was necessary to leave the crowds behind and to seek solitude and the guidance of God. The next time we find ourselves surrounded with obstacles that seem immovable, let's find a quiet place and seek the Lord's guidance.\r\n","thought_for_the_day":"A quiet time with God refreshes and gives us guidance. ","prayer":"Guiding Father, may we follow the example of your Son in going to a quiet place to commune with you and in seeking your will for our lives.  Amen.\r\n","prayer_focus":"Those facing obstructions in their lives","notes":"","id":"1426021438481","submission_author":{"email_address":"normacm@tds.net","name":"Norma C. Mezoe ","legal_name":"Norma C. Mezone","gender":"female","mailing_address":"P.O. Box 217\r\nSandborn, IN 47578","phone_number":"812-694-7643","bio":"n/a","honorific":"Ms."}}
